In [2]:
from openpyxl import Workbook, load_workbook
import pandas as pd
from openpyxl.utils.dataframe import dataframe_to_rows as df_to_row
import numpy as np

In [3]:
path_to_data = 'C:/Users/PetukhovMD/Desktop/szp/'
path_to_docs = 'C:/Users/PetukhovMD/Desktop/справочники/'
months = ['feb.xlsx', 'jan.xlsx']
sheet = 'Sheet'

In [4]:
def to_double(row, f_name):
    if type(row[f_name]) is float:
        return row[f_name] 
    t = str(row[f_name]).split(',')
    if t[0] == 'nan':
        return 0.0
    return float(t[0]+'.'+t[1])

In [153]:
df = pd.read_excel(path_to_data + 'jan.xlsx')
df.stv = df.apply(lambda row: to_double(row, 'stv'), axis=1)
sample = df[(df.stv >= 1.0) & (df.status == 'Работа') & (df.day == 1) & ((df.type == 'Основное место работы') | (df.type == 'Внутреннее совместительство')) & (df.inn != 9718071371)]
sums = sample.iloc[:, [0,1,2,3]].groupby(['inn', 'snils']).sum().reset_index()
sums = pd.merge(sums, sample[sample.type == 'Основное место работы'], how='left', on='snils')
sums = sums[['inn_x', 'snils', 'sum_x', 'job']].drop_duplicates(['inn_x', 'snils', 'sum_x'])
sums = sums.rename(columns = {'inn_x': 'inn', 'sum_x': 'sum_jan', 'job':'job_jan'})
sums

               inn           snils    sum_jan              job_jan
0       5003021368  001-191-281 85  106626.88              Учитель
1       5003021368  001-244-107 65  109394.87              Учитель
2       5003021368  001-263-234 77   74520.00          Воспитатель
3       5003021368  001-322-594 80   83013.52           Специалист
4       5003021368  001-519-663 10  142589.38              Учитель
...            ...             ...        ...                  ...
112510  9715217689  174-783-284 11   87674.67              Учитель
112511  9715217689  185-436-935 07  103382.85              Учитель
112512  9715217689  185-540-582 90   65495.67          Воспитатель
112513  9715217689  191-336-708 73  147433.25              Учитель
112514  9715217689  202-859-541 64  109550.00  Старший воспитатель

[112515 rows x 4 columns]

In [155]:
df = pd.read_excel(path_to_data + 'feb.xlsx')
df.stv = df.apply(lambda row: to_double(row, 'stv'), axis=1)
sample = df[(df.stv >= 1.0) & (df.status == 'Работа') & (df.day == 1) & ((df.type == 'Основное место работы') | (df.type == 'Внутреннее совместительство')) & (df.inn != 9718071371)]
sums = sample.iloc[:, [0,1,2,3]].groupby(['inn', 'snils']).sum().reset_index()
sums = pd.merge(sums, sample[sample.type == 'Основное место работы'], how='left', on='snils')
sums = sums[['inn_x', 'snils', 'sum_x', 'job']].drop_duplicates(['inn_x', 'snils', 'sum_x'])
sums = sums.rename(columns = {'inn_x': 'inn', 'sum_x': 'sum_feb', 'job':'job_feb'})

In [154]:
res = sums

In [157]:
res

,inn,snils,sum_jan,job_jan,sum_feb,job_feb
0,5003021368,001-191-281 85,106626.88,Учитель,139753.92,Учитель
1,5003021368,001-244-107 65,109394.87,Учитель,109541.13,Учитель
2,5003021368,001-263-234 77,74520.00,Воспитатель,81178.00,Воспитатель
3,5003021368,001-322-594 80,83013.52,Специалист,75815.00,Специалист
4,5003021368,001-519-663 10,142589.38,Учитель,163810.32,Учитель
...,...,...,...,...,...,...
130956,9715217689,173-260-871 66,NaN,NaN,67358.00,Воспитатель
130957,9715217689,184-638-768 23,NaN,NaN,142971.65,Педагог-организатор
130958,9715217689,184-820-648 92,NaN,NaN,79250.00,Специалист по закупкам
130959,9715217689,187-933-260 19,NaN,NaN,125727.05,Учитель
130960,9715217689,195-450-909 00,NaN,NaN,95099.10,Педагог-организатор

In [156]:
res = res.merge(sums, how= 'outer', on=['inn', 'snils'])

In [141]:
def print_df(df, name):
    wb = Workbook()
    ws = wb.active
    for  i in df_to_row(df, header=True):
        ws.append(i)
    wb.save(name + '.xlsx')

In [142]:
print_df(res[(res.inn == 5003021368) & (res.job_feb == 'Учитель')], 'teach_check')

In [140]:
res[(res.inn == 5003021368) & (res.job_feb == 'Учитель')]

               inn           snils    sum_jan  job_jan    sum_feb  job_feb
0       5003021368  001-191-281 85  106626.88  Учитель  139753.92  Учитель
1       5003021368  001-244-107 65  109394.87  Учитель  109541.13  Учитель
4       5003021368  001-519-663 10  142589.38  Учитель  163810.32  Учитель
12      5003021368  002-562-177 05  120186.98  Учитель  126052.62  Учитель
13      5003021368  003-558-539 37  162794.38  Учитель  164070.76  Учитель
...            ...             ...        ...      ...        ...      ...
111726  5003021368  184-368-596 18        NaN      NaN   95041.16  Учитель
111727  5003021368  185-440-856 91        NaN      NaN  134346.19  Учитель
111728  5003021368  186-233-031 60        NaN      NaN  135970.02  Учитель
111730  5003021368  189-582-355 36        NaN      NaN  104020.57  Учитель
111733  5003021368  203-743-711 36        NaN      NaN  108246.32  Учитель

[175 rows x 6 columns]

In [48]:
def szp(row, months):
    if pd.isna(row['job_' + months[-1]]):
        return np.nan
    cnt = 0
    sum_szp = 0
    for month in months:
        if pd.isna(row['sum_' + month]):
            continue
        cnt += 1
        sum_szp += row['sum_' + month]
    # if row['inn'] == 9715217689 and row['snils'] == '173-260-871 66':
    #     print(cnt, sum_szp)
    return sum_szp / cnt

In [158]:
res['szp'] = res.apply(lambda row: szp(row, ['jan', 'feb']), axis= 1)

In [55]:
depr_month_inc = 84100.0

In [20]:
df = pd.read_excel(path_to_docs + 'input.xlsx', sheet_name='УГД')

In [24]:
df

,Должность,УГД,Педагогический,Работники непосредственно осуществляющие и обеспечивающие основной учебно-вспомогательный процесс во взаимодействии с детьми
0,Главный бухгалтер,Административно-управленческий персонал,0,0
1,Директор,Административно-управленческий персонал,0,0
2,Директор филиала,Административно-управленческий персонал,0,0
3,Заведующий,Административно-управленческий персонал,0,0
4,Заместитель главного бухгалтера,Административно-управленческий персонал,0,0
...,...,...,...,...
291,Эксперт,Прочий персонал (включая иной административный...,0,0
292,Электромеханик,Прочий персонал (включая иной административный...,0,0
293,Старший юрисконсульт,Прочий персонал (включая иной административный...,0,0
294,Ведущий юрисконсульт,Прочий персонал (включая иной административный...,0,0
295,Юрисконсульт,Прочий персонал (включая иной административный...,0,0

In [23]:
ped = df[df['Педагогический'] == 1]['Должность'].tolist()
ped

['Ассистент',
 'Декан факультета',
 'Директор института',
 'Доцент',
 'Заведующий кафедрой',
 'Профессор',
 'Преподаватель',
 'Старший преподаватель',
 'Воспитатель',
 'Инструктор-методист',
 'Инструктор по труду',
 'Инструктор по физической культуре',
 'Концертмейстер',
 'Мастер производственного обучения',
 'Методист',
 'Музыкальный руководитель',
 'Педагог дополнительного образования',
 'Педагог-библиотекарь',
 'Педагог-организатор',
 'Педагог-психолог ',
 'Преподаватель ',
 'Преподаватель-организатор основ безопасности жизнедеятельности',
 'Руководитель физического воспитания',
 'Социальный педагог',
 'Старший вожатый',
 'Старший воспитатель',
 'Старший инструктор-методист',
 'Старший методист',
 'Старший педагог дополнительного образования',
 'Старший педагог-психолог',
 'Старший тренер-преподаватель',
 'Тренер-преподаватель',
 'Тьютор',
 'Учитель',
 'Учитель-дефектолог',
 'Учитель-логопед']

In [25]:
isp = df[df['Работники непосредственно осуществляющие и обеспечивающие основной учебно-вспомогательный процесс во взаимодействии с детьми'] == 1]['Должность'].tolist()
isp

['Преподаватель',
 'Воспитатель',
 'Инструктор по физической культуре',
 'Концертмейстер',
 'Мастер производственного обучения',
 'Музыкальный руководитель',
 'Педагог дополнительного образования',
 'Педагог-организатор',
 'Педагог-психолог ',
 'Преподаватель ',
 'Социальный педагог',
 'Тьютор',
 'Учитель',
 'Учитель-дефектолог',
 'Учитель-логопед',
 'Помощник воспитателя',
 'Младший воспитатель']

In [51]:
def szp_ped(row, months):
    sum_szp = 0
    cnt = 0
    for month in months:
        if row['job_' + month] in ped:
            cnt += 1
            sum_szp += row['sum_' + month]
    if cnt == 0 or pd.isna(row['job_' + months[-1]]):
        return np.nan
    return sum_szp / cnt

In [159]:
res['szp_ped'] = res.apply(lambda row: szp_ped(row, ['jan', 'feb']), axis=1)

In [161]:
val_5 = res[['inn', 'szp_ped']].groupby('inn').mean()
val_5['value'] = val_5['szp_ped'] / depr_month_inc
val_5

                  szp_ped     value
inn
5003021368  102251.195455  1.215829
5003021495  109061.435581  1.296807
5003021640  117003.647170  1.391244
5003096290  100078.023906  1.189988
5030032182  105850.473651  1.258626
...                   ...       ...
7743939315  104540.877500  1.243054
7743940590  136533.929551  1.623471
9705101759            NaN       NaN
9715206976  106223.829945  1.263066
9715217689  101049.625154  1.201541

[595 rows x 2 columns]

In [162]:
val_6 = res[['inn', 'szp_ped']].groupby('inn').quantile(0.5).rename(columns={'szp_ped': 'q'})
val_6 = pd.merge(val_6, res[['inn', 'szp_ped']], how='right', on='inn')
val_6 = val_6[val_6.szp_ped <= val_6.q][['inn', 'szp_ped']].groupby('inn').mean()
val_6

                  szp_ped
inn
5003021368   75640.146839
5003021495   85421.727149
5003021640   86247.207554
5003096290   71240.875243
5030032182   76387.475952
...                   ...
7743937357   98423.758214
7743939315   80638.806429
7743940590  111136.985385
9715206976   80471.555989
9715217689   75568.116231

[584 rows x 1 columns]

In [173]:
cnt1 = res[res.job_feb == 'Учитель'][['inn', 'szp_ped']].groupby('inn').count().rename(columns= {'szp_ped': 'cnt1'})
cnt1

            cnt1
inn
5003021368   209
5003021495   179
5003021640   177
5003096290   125
5030032182    47
...          ...
7743937357    24
7743939315    20
7743940590   105
9715206976    88
9715217689    59

[515 rows x 1 columns]

In [175]:
cnt2 = res[(res.job_feb == 'Учитель') & (res.szp >= 84100)][['inn', 'szp_ped']].groupby('inn').count().rename(columns= {'szp_ped': 'cnt2'})
cnt2

            cnt2
inn
5003021368   208
5003021495   179
5003021640   177
5003096290   125
5030032182    46
...          ...
7743937357    24
7743939315    20
7743940590   105
9715206976    83
9715217689    59

[515 rows x 1 columns]

In [176]:
val_7 = pd.merge(cnt1, cnt2, how='outer', on='inn')
val_7['val'] = val_7.cnt2 / val_7.cnt1
val_7[val_7.val < 1]

            cnt1  cnt2       val
inn
5003021368   209   208  0.995215
5030032182    47    46  0.978723
5051005623    41    40  0.975610
5074045703   135   132  0.977778
7701905508    59    58  0.983051
...          ...   ...       ...
7743868110    53    49  0.924528
7743917311    70    69  0.985714
7743928539    17    16  0.941176
7743935328    67    64  0.955224
9715206976    88    83  0.943182

[157 rows x 3 columns]

In [206]:
def q_cnt1(row):
    if pd.isna(row['szp']):
        return np.nan
    return row['szp'] if row['szp'] <= row['0.1'] else np.nan

In [207]:
def q_cnt2(row):
    if pd.isna(row['szp']):
        return np.nan
    return row['szp'] if row['szp'] >= row['0.9'] else np.nan

In [208]:
q01 = res[['inn','szp']].groupby('inn').quantile(0.1).rename(columns={'szp':'0.1'})
q09 = res[['inn','szp']].groupby('inn').quantile(0.9).rename(columns={'szp':'0.9'})
q = pd.merge(q01, q09, how='right', on='inn')
qm = pd.merge(res[['inn', 'szp']], q, how='left', on='inn')
qm['cnt1'] = qm.apply(lambda row: q_cnt1(row), axis=1)
qm['cnt2'] = qm.apply(lambda row: q_cnt2(row), axis=1)
qm_pers = pd.merge(qm[qm['szp'].isna() == False], res[['inn','szp', 'snils']], how='left', on=['inn', 'szp']).drop_duplicates(['inn', 'snils'])
qm = qm[['inn', 'cnt1', 'cnt2']].groupby('inn').mean()
qm['ans'] = qm.cnt2 / qm.cnt1
qm[qm.ans > 3.7]

                    cnt1           cnt2       ans
inn
7701293580  74268.750000  287666.510625  3.873318
7702061938  75662.750000  345546.666667  4.566932
7703738796  53931.551429  205599.179286  3.812224
7704040242  85182.432222  388053.534444  4.555558
7704118139  55315.714286  237911.405000  4.300973
...                  ...            ...       ...
7743023522  51797.185233  197739.932326  3.817581
7743024406  52700.617500  197218.967143  3.742252
7743085712  78738.851333  370557.365333  4.706157
7743905443  54337.024306  209534.010278  3.856192
9715206976  55535.566552  214926.705000  3.870073

[94 rows x 3 columns]

In [197]:
q01[q01['0.1'].isna()]

Empty DataFrame
Columns: [0.1]
Index: []

In [209]:
print_df(qm, 'dezil')
print_df(qm_pers, 'dezil_pers')

In [205]:
cnt1 = res[res.job_feb == 'Учитель'][['inn', 'szp']].groupby('inn').mean().rename(columns={'szp':'cnt1'})
cnt2 = res[res.job_feb == 'Учитель'][['inn', 'szp']].groupby('inn').quantile(0.5).rename(columns={'szp':'q'})
cnt2 = pd.merge(cnt2, res[['inn', 'szp']], how='right', on='inn')
cnt2 = cnt2[cnt2.szp <= cnt2.q][['inn', 'szp']].groupby('inn').mean().rename(columns={'szp':'cnt2'})
val_15 = pd.merge(cnt2, cnt1, how='left', on='inn')
val_15['val'] = val_15.cnt1 / val_15.cnt2
val_15[val_15.val > 1.4][['val']].describe()

              val
count  380.000000
mean     1.511619
std      0.073695
min      1.400295
25%      1.458065
50%      1.504853
75%      1.550067
max      1.781473

In [170]:
print_df(val_15, 'val_15')

In [79]:
out = res[['inn', 'szp_ped']].groupby('inn').count().rename(columns={'szp_ped': 'Количество педов'})
out

            Количество педов
inn
5003021368               433
5003021495               447
5003021640               371
5003096290               285
5030032182               126
...                      ...
7743939315                42
7743940590               141
9705101759                 0
9715206976               182
9715217689               130

[595 rows x 1 columns]

In [92]:
out = df[df.job.isin(['Учитель'])].drop_duplicates(['inn', 'snils'])[['inn', 'snils']].groupby('inn').count().rename(columns={'snils':'Количество педов'})

In [94]:
out
wb = Workbook()
ws = wb.active
for  i in df_to_row(out, header=True):
    ws.append(i)
wb.save('teach.xlsx')

In [ ]:
school_sum = sample[['inn', 'sum']].groupby('inn').sum()

In [ ]:
school_sum

In [ ]:
s = sums.groupby(['snils']).count().reset_index()
wb = Workbook()
ws = wb.active
for  i in df_to_row(s, header=True):
    ws.append(i)
wb.save('test.xlsx')